## [09] Membagi Data Frame Menjadi Dua Secara Acak

### [9.1] Import Module

In [2]:
import pandas as pd
import numpy as np
#mencetak versi pandas dan numpy yang akan digunakan
print(pd.__version__)
print(np.__version__)

1.0.5
1.18.5

### [9.2] Persiapan Data Frame

In [3]:
#data frame terdiri dari 10 baris dan 5 kolom
n_rows = 10
n_cols = 5
#kolom akan diberi label A B C D dan E
cols = tuple('ABCDE')
df = pd.DataFrame(np.random.randint(1,20,size=(n_rows,n_cols)),columns=cols)
df

    A   B   C   D   E
0   2  17  19   1  19
1   9  17   9  15   8
2   3   9  10   6   5
3   7   1  14  18  12
4  13  19  14   2   2
5  13  14   5   7   3
6  15  12   7  14  12
7  12  15   2  12  18
8   3  13   4   7   6
9   2  10  17  17   1

### [9.3] Membagi Data Frame menjadi dua secara acak berdasarkan proporsi tertentu

In [4]:
#.shape digunakan untuk mengecek bentuk dari dataframe 
df.shape

(10, 5)

In [5]:
#variabel proporsi disini memiliki arti kita ingin membagi 70% dari data frame utama ke data frame pertama dan 30% sisanya di dataframe kedua
proporsi = 0.7
#method .sample() digunakan untuk mengambil baris secara acak sebanyak proporsi yang sudah ditentukan sebelumnya
df_1 = df.sample(frac=proporsi)
#method .drop() digunakan untuk menghapus baris-baris yang sudah diadopsi di df_1
df_2 = df.drop(df_1.index)
#mencetak shape dari ketua data frame
print(f' d_1 shape : {df_1.shape}')
print(f' d_2 shape : {df_2.shape}')

 d_1 shape : (7, 5)
 d_2 shape : (3, 5)

In [6]:
#memanggil isi dari df_1
df_1

    A   B   C   D   E
1   9  17   9  15   8
2   3   9  10   6   5
0   2  17  19   1  19
9   2  10  17  17   1
3   7   1  14  18  12
8   3  13   4   7   6
6  15  12   7  14  12

In [7]:
#memanggil isi dari df_2
df_2

    A   B   C   D   E
4  13  19  14   2   2
5  13  14   5   7   3
7  12  15   2  12  18

## [10] Mengganti Nama (label) kolom pada Data Frame berdasarkan pola

### [10.1] Import Module

In [8]:
import pandas as pd
#mencetak versi pandas yang akan digunakan
print(pd.__version__)

1.0.5

### [10.2] Persiapan Data Frame

In [11]:
#data titanicfull.csv bisa didownload dari kaggle
df = pd.read_csv('./titanicfull.csv')
# mengatur nama kolom
df.columns = ['Pclass', 'Survival status','full Name','Sex ',' Age','Sib SP','Parch','Ticket','Fare','Cabin','Embarked']
df_backup = df.copy(deep=True)
#mengambil 5 data pertama dari data frame
df.head()

,Pclass,Survival status,full Name,Sex,Age,Sib SP,Parch,Ticket,Fare,Cabin,Embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S

### [10.3] Menggunakan Lowercase untuk Nama Kolom dan Mengganti Spasi dengan _

In [12]:
#mengganti spasi dengan_ serta menyeragamkan semua karakter upper case menjadi lowercase
df.columns = df.columns.str.replace(' ','_').str.lower()
#mengambil 5 data pertama dari data frame
df.head()

,pclass,survival_status,full_name,sex_,_age,sib_sp,parch,ticket,fare,cabin,embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S

### [10.4] Memangkas Kelebihan Spasi pada Kolom

In [13]:
df = df_backup.copy(deep=True)
#method .str.strip() akan memotong kelebihan spasi pada kolom dataframe
df.columns = df.columns.str.lower().str.strip().str.replace(' ','_')
df.head()

,pclass,survival_status,full_name,sex,age,sib_sp,parch,ticket,fare,cabin,embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S

## [11] Melakukan seleksi kolom dan baris pada Data Frame menggunakan loc

### [11.1] Import Module

In [14]:
import pandas as pd
import numpy as np
#mencetak versi pandas dan numpy yang akan digunakan
print(pd.__version__)
print(np.__version__)

1.0.5
1.18.5

### [11.2] Persiapan Data Frame

In [15]:
#data frame terdiri dari 10 baris dan 5 kolom
n_rows = 10
n_cols = 5
#kolom akan diberi label A B C D dan E
cols = tuple('ABCDE')
df = pd.DataFrame(np.random.randint(1,20,size=(n_rows,n_cols)),columns=cols)
df

    A   B   C   D   E
0   4  15  15   8  16
1  11  12  11   1   5
2  15  11   8   8  11
3   4   6   2  12   6
4   8  16   3  17  16
5   8  19   8  11  13
6  16  19  16   1  17
7   4   2  13  14   5
8  18  18   5  19  10
9   7   3   9   9   7